// This file is auto generated by perl scrip, do not modify it!



#ifndef _G3D_ENG_H_

#define _G3D_ENG_H_



#define SINGLE_COMMAND 0x20000000

#define PACKET_COMMAND 0x30000000

// global registers



/****************************************************************************************/

#define REG_ENABLE           0x8000    //debug offset = 0x0

/*--------------------------------------------------------------------------------------*/

#define MSK_TS_AA_EN         0x00000002 //anti-alias line mode sel

#define SHF_TS_AA_EN         1



/*--------------------------------------------------------------------------------------*/

#define MSK_SE_AA_EN         0x00000004 //Enable anti-alias line or triangle

#define SHF_SE_AA_EN         2



/*--------------------------------------------------------------------------------------*/

#define MSK_SE_ZERO_PIX_DROP_EN 0x00000008 //Drop the triangle if all 3 vertex interger part are the same while fraction part not equal 0

										// X.int or Y.int are the same value & X.Frac !=0, Y.Frac!=0

#define SHF_SE_ZERO_PIX_DROP_EN 3



/*--------------------------------------------------------------------------------------*/

#define MSK_SE_CULL_EN       0x00000010 //Enable Setup back face culling, need reference "SE_CULL_DIR"

#define SHF_SE_CULL_EN       4



/*--------------------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------------------*/

#define MSK_PNG_TRANS_EN     0x00004000 //default png per pixel alpha

#define SHF_PNG_TRANS_EN     14



/*--------------------------------------------------------------------------------------*/

#define MSK_PNG_TRANS_B      0xffff0000 //png transparency b value

#define SHF_PNG_TRANS_B      16





/****************************************************************************************/

#define REG_PNG_STATE        0x83bc    //debug offset = 0x778

/*--------------------------------------------------------------------------------------*/

#define MSK_PNG_STATE        0xffffffff //png state

#define SHF_PNG_STATE        0





/****************************************************************************************/

#define REG_IFIFO_CNT        0x83c0    //debug offset = 0x780

/*--------------------------------------------------------------------------------------*/

#define MSK_IFIFO_CNT        0x00ffffff //ififo reaq bytes

#define SHF_IFIFO_CNT        0



/*--------------------------------------------------------------------------------------*/

#define MSK_GPD_PGEND        0x03000000 //gpd page end enable,  bit0(decom): ccache, bit1(deflt): zcache

#define SHF_GPD_PGEND        24





/****************************************************************************************/

#define REG_FRUN_CNT         0x83c4    //debug offset = 0x788

/*--------------------------------------------------------------------------------------*/

#define MSK_FRUN_CNT         0x00ffffff //free run counter to prevent brain dead

#define SHF_FRUN_CNT         0





/****************************************************************************************/

#define REG_CONST_PSIZE      0x83c8    //debug offset = 0x790

/*--------------------------------------------------------------------------------------*/

#define MSK_CONST_PSIZE      0xffffffff //default point size

#define SHF_CONST_PSIZE      0





/****************************************************************************************/

#define REG_TX_LODBIAS       0x83cc    //debug offset = 0x798

/*--------------------------------------------------------------------------------------*/

#define MSK_TX_LODBIAS       0x000003ff //default texture lod bias

#define SHF_TX_LODBIAS       0



/*--------------------------------------------------------------------------------------*/

#define MSK_BLK_CTRI         0x00008000 //default use T8 INTP

#define SHF_BLK_CTRI         15





/****************************************************************************************/

// packet data definitions

/*--------------------------------------------------------------------------------------*/



#define PKT_TYPE_TNL                        0

#define PKT_TYPE_TEX_PALETTE                4





//

// Engine global registers

//



typedef struct _EngGlobals

{

	U32 dwEnable            ; // 0x8000 

	U32 dwPrimEnd           ; // 0x8030 

	U32 dwFireMode          ; // 0x8034 

	U32 dwPrimType          ; // 0x8038 

	U32 dwVec01Fmt          ; // 0x803c 

	U32 dwVec23Fmt          ; // 0x8040 

	U32 dwVec45Fmt          ; // 0x8044 

	U32 dwVec67Fmt          ; // 0x8048 

	U32 dwAaTz              ; // 0x804c 

	U32 dwZiniValue         ; // 0x8050 

	U32 dwAaBase            ; // 0x8058 

	U32 dwAaPitch           ; // 0x805c 

	U32 dwTzBase            ; // 0x8064 

	U32 dwTzPitch           ; // 0x8068 

	U32 dwSetupSet          ; // 0x806c 

	U32 dwDepthScale        ; // 0x8070 

	U32 dwDepthOffset       ; // 0x8074 

	U32 dwXOfstUyst         ; // 0x8078 

	U32 dwYOfstVyst         ; // 0x807c 

	U32 dwXScalUdx          ; // 0x8080 

	U32 dwYScalVdy          ; // 0x8084 

	U32 dwG3dpllCtrl0       ; // 0x8088 

	U32 dwG3dpllCtrl1       ; // 0x808c 

	U32 dwClipLr            ; // 0x8090 

	U32 dwClipTb            ; // 0x8094 

	U32 dwPageEnd           ; // 0x8098 

	U32 dwWlineWidth        ; // 0x809c 

	U32 dwTsAa              ; // 0x80a8 

	U32 dwGpGbl0            ; // 0x80b4 

	U32 dwGpGbl1            ; // 0x80b8 

	U32 dwTxNum             ; // 0x80c4 

	U32 dwTex0Set0          ; // 0x80e0 

	U32 dwTex0Set1          ; // 0x80e4 

	U32 dwTex1Set0          ; // 0x80e8 

	U32 dwTex1Set1          ; // 0x80ec 

	U32 dwTex2Set0          ; // 0x80f0 

	U32 dwTex2Set1          ; // 0x80f4 

	U32 dwTex3Set0          ; // 0x80f8 

	U32 dwTex3Set1          ; // 0x80fc 

	U32 dwTex4Set0          ; // 0x8100 

	U32 dwTex4Set1          ; // 0x8104 

	U32 dwTex5Set0          ; // 0x8108 

	U32 dwTex5Set1          ; // 0x810c 

	U32 dwTex6Set0          ; // 0x8110 

	U32 dwTex6Set1          ; // 0x8114 

	U32 dwTex7Set0          ; // 0x8118 

	U32 dwTex7Set1          ; // 0x811c 

	U32 dwTexMisc           ; // 0x8120 

	U32 dwTexMisc1          ; // 0x8124 

	U32 dwTexBorderColor    ; // 0x8128 

	U32 dwEnable2           ; // 0x8134 

	U32 dwEnable3           ; // 0x8138 

	U32 dwColorPost         ; // 0x813c 

	U32 dwColorPost2        ; // 0x8140 

	U32 dwColorWtBase       ; // 0x8144 

	U32 dwColorPitch        ; // 0x8148 

	U32 dwColorRdBase       ; // 0x814c 

	U32 dwColorFormat       ; // 0x8150 

	U32 dwCpConst           ; // 0x8164 

	U32 dwFogColor          ; // 0x8168 

	U32 dwColorKeyMode      ; // 0x816c 

	U32 dwSrcClrKeyLow      ; // 0x8170 

	U32 dwSrcClrKeyHigh     ; // 0x8174 

	U32 dwDstClrKeyLow      ; // 0x8178 

	U32 dwDstClrKeyHigh     ; // 0x817c 

	U32 dwDispbufBas        ; // 0x8180 

	U32 dwZStencilTest      ; // 0x8184 

	U32 dwZStencilMask      ; // 0x8188 

	U32 dwZFormat           ; // 0x818c 

	U32 dwZPitch            ; // 0x8190 

	U32 dwZBase             ; // 0x8194 

	U32 dwStBkMd            ; // 0x8198 

	U32 dwStbufBas          ; // 0x819c 

	U32 dwStbufPitch        ; // 0x81a0 

	U32 dwReqPriSet0        ; // 0x81b4 

	U32 dwShdDir            ; // 0x81c0 

	U32 dw2dLinePat         ; // 0x81c4 

	U32 dw2dLineSet         ; // 0x81c8 

	U32 dwStreamNum         ; // 0x81cc 

	U32 dwStreamSet0        ; // 0x81d0 

	U32 dwStreamSet1        ; // 0x81d4 

	U32 dwStream0Bas        ; // 0x81dc 

	U32 dwStream1Bas        ; // 0x81e0 

	U32 dwStream2Bas        ; // 0x81e4 

	U32 dwStream3Bas        ; // 0x81e8 

	U32 dwStream4Bas        ; // 0x81ec 

	U32 dwStream5Bas        ; // 0x81f0 

	U32 dwStream6Bas        ; // 0x81f4 

	U32 dwStream7Bas        ; // 0x81f8 

	U32 dwStream01Stride    ; // 0x81fc 

	U32 dwStream23Stride    ; // 0x8200 

	U32 dwStream45Stride    ; // 0x8204 

	U32 dwStream67Stride    ; // 0x8208 

	U32 dwVfont             ; // 0x8210 

	U32 dwVgSet             ; // 0x8214 

	U32 dwClipSet0          ; // 0x8218 

	U32 dwLineGlAaHalfWidth ; // 0x821c 

	U32 dwClipSet1          ; // 0x8220 

	U32 dwStrokeHalfWidth   ; // 0x8224 

	U32 dwClipSet2          ; // 0x8228 

	U32 dwDashPatIniLen     ; // 0x822c 

	U32 dwDashPatIniIdx     ; // 0x8230 

	U32 dwVgXsmax           ; // 0x8234 

	U32 dwVgYsmax           ; // 0x8238 

	U32 dwVgXsmaxGb         ; // 0x823c 

	U32 dwVgYsmaxGb         ; // 0x8240 

	U32 dwVgYsminGb         ; // 0x8244 

	U32 dwVpTransform       ; // 0x8248 

	U32 dwViewportScaleTux0 ; // 0x824c 

	U32 dwViewportScaleTux1 ; // 0x8250 

	U32 dwViewportScaleTux2 ; // 0x8254 

	U32 dwViewportOffsetTuy0; // 0x8258 

	U32 dwViewportOffsetTuy1; // 0x825c 

	U32 dwViewportOffsetTuy2; // 0x8260

	U32 dwUshMisc           ; // 0x8268

	U32 dwShaderSet0        ; // 0x826c 

	U32 dwUshSet1           ; // 0x8270 

	U32 dwUshTh0Bas         ; // 0x8274 

	U32 dwUshTh1Bas         ; // 0x8278 

	U32 dwUshTh2Bas         ; // 0x827c 

	U32 dwUshTh3Bas         ; // 0x8280 

	U32 dwUshTh4Bas         ; // 0x8284 

	U32 dwUshTh5Bas         ; // 0x8288 

	U32 dwUshTh6Bas         ; // 0x828c 

	U32 dwUshTh7Bas         ; // 0x8290 

	U32 dwUshTh8Bas         ; // 0x8294 

	U32 dwUshTh9Bas         ; // 0x8298 

	U32 dwUshMrtBas         ; // 0x829c 

	U32 dwUshPitch          ; // 0x82a0 

	U32 dwUshSc0Bas         ; // 0x82a4 

	U32 dwUshSc1Bas         ; // 0x82a8 

	U32 dwUshSc2Bas         ; // 0x82ac 

	U32 dwUshSc3Bas         ; // 0x82b0 

	U32 dwUshSc4Bas         ; // 0x82b4 

	U32 dwUshSc5Bas         ; // 0x82b8 

	U32 dwUshSc6Bas         ; // 0x82bc 

	U32 dwUshSc7Bas         ; // 0x82c0 

	U32 dwUshSc01Stride     ; // 0x82c4 

	U32 dwUshSc23Stride     ; // 0x82c8 

	U32 dwUshSc45Stride     ; // 0x82cc 

	U32 dwUshSc67Stride     ; // 0x82d0 

	U32 dwUshIqmBase        ; // 0x82d4 

	U32 dwUshInsNum         ; // 0x82d8 

	U32 dwUshPsIqBase       ; // 0x82dc 

	U32 dwUshVsIqBase       ; // 0x82e0 

	U32 dwUshLod            ; // 0x82e4 

	U32 dwUshThInit         ; // 0x82e8 

	U32 dwArGpA0RqPri       ; // 0x82ec 

	U32 dwArGpB0RqPri       ; // 0x82f0 

	U32 dwArGpC0RqPri       ; // 0x82f4 

	U32 dwArGpC0Serv        ; // 0x82f8 

	U32 dwArGpA1RqPri       ; // 0x82fc 

	U32 dwArGpB1RqPri       ; // 0x8300 

	U32 dwArGpC1RqPri       ; // 0x8304 

	U32 dwArGpC1Serv        ; // 0x8308 

	U32 dwArWdPack          ; // 0x830c 

	U32 dwCh2memBankSel     ; // 0x8310 

	U32 dwConstPsize        ; // 0x83c8 

	U32 dwTxLodbias         ; // 0x83cc 



	// packets

	U32 dwTexturePalette[256];		// 32 bits for 1 palette entry

} EngGlobals;





#endif	// _G3D_ENG_H_

